mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xn/mb9bf56xn.svd
        <!-- REGISTER "IRQ011MON" -->
        <register>
          <name>IRQ011MON</name>
          <description>IRQ011 Batch Read Register [BHW]</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ012MON" -->
        <register>
          <name>IRQ012MON</name>
          <description>IRQ012 Batch Read Register [BHW]</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ013MON" -->
        <register>
          <name>IRQ013MON</name>
          <description>IRQ013 Batch Read Register [BHW]</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ014MON" -->
        <register>
          <name>IRQ014MON</name>
          <description>IRQ014 Batch Read Register [BHW]</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ015MON" -->
        <register>
          <name>IRQ015MON</name>
          <description>IRQ015 Batch Read Register [BHW]</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ016MON" -->
        <register>
          <name>IRQ016MON</name>
          <description>IRQ016 Batch Read Register [BHW]</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.5</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ017MON" -->
        <register>
          <name>IRQ017MON</name>
          <description>IRQ017 Batch Read Register [BHW]</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ018MON" -->
        <register>
          <name>IRQ018MON</name>
          <description>IRQ018 Batch Read Register [BHW]</description>
          <addressOffset>0x24C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.7</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
